ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G401/N32G401.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOB</name>
            <baseAddress>0x40023800</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOC</name>
            <baseAddress>0x40023C00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOD</name>
            <baseAddress>0x40024000</baseAddress>
        </peripheral>

        <peripheral>
            <name>AFIO</name>
            <description>Alternate function I/O</description>
            <groupName>AFIO</groupName>
            <baseAddress>0x40010000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>AFIO_RMP_CFG</name>
                    <displayName>AFIO_RMP_CFG</displayName>
                    <description>AFIO_RMP_CFG</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>EXTI_ETRR</name>
                            <description>EXTI_ETRR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EXTI_ETRI</name>
                            <description>EXTI_ETRI</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADC_ETRR</name>
                            <description>ADC_ETRR</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC_ETRI</name>
                            <description>ADC_ETRI</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI2_NSS</name>
                            <description>SPI2_NSS</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI1_NSS</name>
                            <description>SPI1_NSS</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_EXTI_CFG1</name>
                    <displayName>AFIO_EXTI_CFG1</displayName>
                    <description>AFIO_EXTI_CFG1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003333</resetMask>
                    <fields>
                        <field>
                            <name>EXTI0</name>
                            <description>EXTI0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>EXTI1</name>
                            <description>EXTI1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>EXTI2</name>
                            <description>EXTI2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>EXTI3</name>
                            <description>EXTI3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_EXTI_CFG2</name>
                    <displayName>AFIO_EXTI_CFG2</displayName>
                    <description>AFIO_EXTI_CFG2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003333</resetMask>
                    <fields>
                        <field>
                            <name>EXTI4</name>
                            <description>EXTI4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>EXTI5</name>
                            <description>EXTI5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>EXTI6</name>
                            <description>EXTI6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>EXTI7</name>
                            <description>EXTI7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_EXTI_CFG3</name>
                    <displayName>AFIO_EXTI_CFG3</displayName>
                    <description>AFIO_EXTI_CFG3</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003333</resetMask>
                    <fields>
                        <field>
                            <name>EXTI8</name>
                            <description>EXTI8</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>EXTI9</name>
                            <description>EXTI9</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>EXTI10</name>
                            <description>EXTI10</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>EXTI11</name>
                            <description>EXTI11</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_EXTI_CFG4</name>
                    <displayName>AFIO_EXTI_CFG4</displayName>
                    <description>AFIO_EXTI_CFG4</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003333</resetMask>
                    <fields>
                        <field>
                            <name>EXTI12</name>
                            <description>EXTI12</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>EXTI13</name>
                            <description>EXTI13</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>EXTI14</name>
                            <description>EXTI14</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>EXTI15</name>
                            <description>EXTI15</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_TOL5V_CFG</name>
                    <displayName>AFIO_TOL5V_CFG</displayName>
                    <description>AFIO_TOL5V_CFG</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PA0TOLENN</name>
                            <description>PA0TOLENN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA1TOLENN</name>
                            <description>PA1TOLENN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA2TOLENN</name>
                            <description>PA2TOLENN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA3TOLENN</name>
                            <description>PA3TOLENN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA4TOLENN</name>
                            <description>PA4TOLENN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA5TOLENN</name>
                            <description>PA5TOLENN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA6TOLENN</name>
                            <description>PA6TOLENN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA7TOLENN</name>
                            <description>PA7TOLENN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA8TOLENN</name>
                            <description>PA8TOLENN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA11TOLENN</name>
                            <description>PA11TOLENN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA12TOLENN</name>
                            <description>PA12TOLENN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA15TOLENN</name>
                            <description>PA15TOLENN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB0TOLENN</name>
                            <description>PB0TOLENN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB1TOLENN</name>
                            <description>PB1TOLENN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB2TOLENN</name>
                            <description>PB2TOLENN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB3TOLENN</name>
                            <description>PB3TOLENN</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB4TOLENN</name>
                            <description>PB4TOLENN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB5TOLENN</name>
                            <description>PB5TOLENN</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB7TOLENN</name>
                            <description>PB7TOLENN</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB10TOLENN</name>
                            <description>PB10TOLENN</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB11TOLENN</name>
                            <description>PB11TOLENN</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB12TOLENN</name>
                            <description>PB12TOLENN</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB13TOLENN</name>
                            <description>PB13TOLENN</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB14TOLENN</name>
                            <description>PB14TOLENN</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB15TOLENN</name>
                            <description>PB15TOLENN</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
