ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G401/N32G401.svd
            </registers>
	    </peripheral>


	   <peripheral>
            <name>PWR</name>
            <description>Power control</description>
            <groupName>PWR</groupName>
            <baseAddress>0x40007000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>PVD</name>
                <description>PVD through EXTI line detection interrupt</description>
                <value>1</value>
            </interrupt>
            <registers>
                <register>
                    <name>PWR_CTRL</name>
                    <displayName>PWR_CTRL</displayName>
                    <description>PWR_CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003FFB</resetMask>
                    <fields>
                        <field>
                            <name>LPS</name>
                            <description>LPS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PDS</name>
                            <description>PDS</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CSBVBAT</name>
                            <description>CSBVBAT</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PVDEN</name>
                            <description>PVDEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLS</name>
                            <description>PLS</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>DBKP</name>
                            <description>DBKP</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MSB</name>
                            <description>MSB</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLRWKUP1</name>
                            <description>CLRWKUP1</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLRWKUP2</name>
                            <description>CLRWKUP2</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLRWKUP3</name>
                            <description>CLRWKUP3</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLRRTCWKUP</name>
                            <description>CLRRTCWKUP</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>                        
                    </fields>
                </register>
                <register>
                    <name>PWR_CTRLSTS</name>
                    <displayName>PWR_CTRLSTS</displayName>
                    <description>PWR_CTRLSTS</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00007F7E</resetMask>
                    <fields>
                        <field>
                            <name>STBYF</name>
                            <description>STBYF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PVDO</name>
                            <description>PVDO</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPF1</name>
                            <description>WKUPF1</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPF2</name>
                            <description>WKUPF2</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPF3</name>
                            <description>WKUPF3</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPRTCF</name>
                            <description>WKUPRTCF</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUP1EN</name>
                            <description>WKUP1EN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUP2EN</name>
                            <description>WKUP2EN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUP3EN</name>
                            <description>WKUP3EN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPRTCEN</name>
                            <description>WKUPRTCEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUP1PS</name>
                            <description>WKUP1PS</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUP2PS</name>
                            <description>WKUP2PS</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUP3PS</name>
                            <description>WKUP3PS</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>                        
                    </fields>
                </register>	
                <register>
                    <name>PWR_CTRL2</name>
                    <displayName>PWR_CTRL2</displayName>
                    <description>PWR_CTRL2</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000005F5</resetMask>
                    <fields>
                        <field>
                            <name>STOP2S</name>
                            <description>STOP2S</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SRSTBRET</name>
                            <description>SRSTBRET</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSITRIM</name>
                            <description>LSITRIM</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>						
                        <field>
                            <name>IWDGRSTEN</name>
                            <description>IWDGRSTEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>													
                    </fields>
                </register>							
