ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G401/N32G401.svd
                <register>
                    <name>RCC_AHBPCLKEN</name>
                    <displayName>RCC_AHBPCLKEN</displayName>
                    <description>RCC_AHBPCLKEN</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000014</resetValue>
                    <resetMask>0x000017d5</resetMask>
                    <fields>
                        <field>
                            <name>DMAEN</name>
                            <description>DMAEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SRAMEN</name>
                            <description>SRAMEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FLITFEN</name>
                            <description>FLITFEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRCEN</name>
                            <description>CRCEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPAEN</name>
                            <description>IOPAEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPBEN</name>
                            <description>IOPBEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPCEN</name>
                            <description>IOPCEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPDEN</name>
                            <description>IOPDEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADCEN</name>
                            <description>ADCEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_APB2PCLKEN</name>
                    <displayName>RCC_APB2PCLKEN</displayName>
                    <description>RCC_APB2PCLKEN</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000e7803</resetMask>
                    <fields>
                        <field>
                            <name>AFIOEN</name>
                            <description>AFIOEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BEEPEN</name>
                            <description>BEEPEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM1EN</name>
                            <description>TIM1EN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI1EN</name>
                            <description>SPI1EN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM8EN</name>
                            <description>TIM8EN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USART1EN</name>
                            <description>USART1EN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART3EN</name>
                            <description>UART3EN</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART4EN</name>
                            <description>UART4EN</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI2EN</name>
                            <description>SPI2EN</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_APB1PCLKEN</name>
                    <displayName>RCC_APB1PCLKEN</displayName>
                    <description>RCC_APB1PCLKEN</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000100</resetValue>
                    <resetMask>0x126208df</resetMask>
                    <fields>
                        <field>
                            <name>TIM2EN</name>
                            <description>TIM2EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM3EN</name>
                            <description>TIM3EN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM4EN</name>
                            <description>TIM4EN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM5EN</name>
                            <description>TIM5EN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIM6EN</name>
                            <description>TIM6EN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMPEN</name>
                            <description>COMPEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COMPFILTEN</name>
                            <description>COMPFILTEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDGEN</name>
                            <description>WWDGEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USART2EN</name>
                            <description>USART2EN</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C1EN</name>
                            <description>I2C1EN</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C2EN</name>
                            <description>I2C2EN</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PWREN</name>
                            <description>PWREN</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_BDCTRL</name>
                    <displayName>RCC_BDCTRL</displayName>
                    <description>RCC_BDCTRL</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x5001831f</resetMask>
                    <fields>
                        <field>
                            <name>LSEEN</name>
                            <description>LSEEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSERD</name>
                            <description>LSERD</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSEBP</name>
                            <description>LSEBP</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSECLKSSEN</name>
                            <description>LSECLKSSEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSECLKSSF</name>
                            <description>LSECLKSSF</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTCSEL</name>
                            <description>RTCSEL</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RTCEN</name>
                            <description>RTCEN</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BDSFTRST</name>
                            <description>BDSFTRST</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_CTRLSTS</name>
                    <displayName>RCC_CTRLSTS</displayName>
                    <description>RCC_CTRLSTS</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0c000003</resetValue>
                    <resetMask>0xff280003</resetMask>
                    <fields>
                        <field>
                            <name>LSIEN</name>
                            <description>LSIEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSIRD</name>
                            <description>LSIRD</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BORRSTF</name>
                            <description>BORRSTF</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BKPEMCF</name>
                            <description>BKPEMCF</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMRSTF</name>
                            <description>RMRSTF</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MMURSTF</name>
                            <description>MMURSTF</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PINRSTF</name>
                            <description>PINRSTF</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PORRSTF</name>
                            <description>PORRSTF</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SFTRSTF</name>
                            <description>SFTRSTF</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDGRSTF</name>
                            <description>IWDGRSTF</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDGRSTF</name>
                            <description>WWDGRSTF</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPWRRSTF</name>
                            <description>LPWRRSTF</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_AHBPRST</name>
                    <displayName>RCC_AHBPRST</displayName>
                    <description>RCC_AHBPRST</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00001780</resetMask>
                    <fields>
                        <field>
                            <name>IOPARST</name>
                            <description>IOPARST</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPBRST</name>
                            <description>IOPBRST</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPCRST</name>
                            <description>IOPCRST</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IOPDRST</name>
                            <description>IOPDRST</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADCRST</name>
                            <description>ADCRST</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_CFG2</name>
                    <displayName>RCC_CFG2</displayName>
                    <description>RCC_CFG2</description>
                    <addressOffset>0x2c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00003800</resetValue>
                    <resetMask>0x2000fdff</resetMask>
                    <fields>
                        <field>
                            <name>ADCHPRES</name>
                            <description>ADCHPRES</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADCPLLPRES</name>
                            <description>ADCPLLPRES</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>ADC1MSEL</name>
                            <description>ADC1MSEL</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC1MPRES</name>
                            <description>ADC1MPRES</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>TIMCLKSEL</name>
                            <description>TIMCLKSEL</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_CFG3</name>
                    <displayName>RCC_CFG3</displayName>
                    <description>RCC_CFG3</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000040</resetValue>
                    <resetMask>0x00000040</resetMask>
                    <fields>
                        <field>
                            <name>BORRSTEN</name>
                            <description>BORRSTEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCC_RDCTRL</name>
                    <displayName>RCC_RDCTRL</displayName>
                    <description>RCC_RDCTRL</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000447</resetMask>
                    <fields>
                        <field>
                            <name>LPTIMSEL</name>
                            <description>LPTIMSEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>LPTIMEN</name>
                            <description>LPTIMEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LPTIMRST</name>
                            <description>LPTIMRST</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
